SELECT Н_УЧЕНИКИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО, AVG(Н_ВЕДОМОСТИ.ОЦЕНКА::integer) AS MID
FROM Н_ЛЮДИ
JOIN Н_УЧЕНИКИ ON Н_ЛЮДИ.ИД = Н_УЧЕНИКИ.ЧЛВК_ИД
JOIN Н_ВЕДОМОСТИ ON Н_ЛЮДИ.ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
WHERE Н_УЧЕНИКИ.ГРУППА = '4100' AND Н_ВЕДОМОСТИ.ОЦЕНКА~'[2-5]'
GROUP BY Н_УЧЕНИКИ.ИД, Н_ЛЮДИ.ФАМИЛИЯ, Н_ЛЮДИ.ИМЯ, Н_ЛЮДИ.ОТЧЕСТВО
HAVING AVG(Н_ВЕДОМОСТИ.ОЦЕНКА::integer) >= (
SELECT MAX(Н_ВЕДОМОСТИ.ОЦЕНКА::integer) 
FROM Н_УЧЕНИКИ
JOIN Н_ВЕДОМОСТИ ON Н_УЧЕНИКИ.ЧЛВК_ИД = Н_ВЕДОМОСТИ.ЧЛВК_ИД
WHERE Н_УЧЕНИКИ.ГРУППА = '3100' AND Н_ВЕДОМОСТИ.ОЦЕНКА~'[2-5]'
);
